Public Attributes | List of all members
API_AnalyticalSupport_SupportValues Struct Reference
Analytical Model
Contains the Structural Analytical Model Analytical Support values. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalRigidityType  | xType
Translation type in X direction.
double  | xValue
Translation value in X direction in case of Custom type.
API_AnalyticalRigidityType  | yType
Translation type in Y direction.
double  | yValue
Translation value in Y direction in case of Custom type.
API_AnalyticalRigidityType  | zType
Translation type in Z direction.
double  | zValue
Translation value in Z direction in case of Custom type.
API_AnalyticalRigidityType  | rxType
Rotation type in X direction.
double  | rxValue
Rotation value in X direction in case of Custom type.
API_AnalyticalRigidityType  | ryType
Rotation type in Y direction.
double  | ryValue
Rotation value in Y direction in case of Custom type.
API_AnalyticalRigidityType  | rzType
Rotation type in Z direction.
double  | rzValue
Rotation value in Z direction in case of Custom type.
Detailed Description
Contains the Structural Analytical Model Analytical Support values.
Since
Archicad 25
Member Data Documentation
◆ rxType
 API_AnalyticalSupport_SupportValues::rxType
Rotation type in X direction.
◆ rxValue
 API_AnalyticalSupport_SupportValues::rxValue
Rotation value in X direction in case of Custom type.
◆ ryType
 API_AnalyticalSupport_SupportValues::ryType
Rotation type in Y direction.
◆ ryValue
 API_AnalyticalSupport_SupportValues::ryValue
Rotation value in Y direction in case of Custom type.
◆ rzType
 API_AnalyticalSupport_SupportValues::rzType
Rotation type in Z direction.
◆ rzValue
 API_AnalyticalSupport_SupportValues::rzValue
Rotation value in Z direction in case of Custom type.
◆ xType
 API_AnalyticalSupport_SupportValues::xType
Translation type in X direction.
◆ xValue
 API_AnalyticalSupport_SupportValues::xValue
Translation value in X direction in case of Custom type.
◆ yType
 API_AnalyticalSupport_SupportValues::yType
Translation type in Y direction.
◆ yValue
 API_AnalyticalSupport_SupportValues::yValue
Translation value in Y direction in case of Custom type.
◆ zType
 API_AnalyticalSupport_SupportValues::zType
Translation type in Z direction.
◆ zValue
 API_AnalyticalSupport_SupportValues::zValue
Translation value in Z direction in case of Custom type.